Table of Contents
 Class IDEAProgressReport
Namespace
IdeaRS.OpenModel.Message
Assembly
IdeaRS.OpenModel.dll
Data for progress report of IOM
public class IDEAProgressReport
Inheritance
object
IDEAProgressReport
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CurrentProgressAmount
current progress
public int CurrentProgressAmount { get; set; }
Property Value
int
 CurrentProgressMessage
some message to pass to the UI of current progress
public string CurrentProgressMessage { get; set; }
Property Value
string
 TotalProgressAmount
total progress
public int TotalProgressAmount { get; set; }
Property Value
int
 Edit this page